3B/SE464/17-Secure-Microservices.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-11 Wed 01:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Secure Microservices</title>
<meta name="author" content="Arnav Gupta" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="src/latex.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Secure Microservices</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org402f049">1. Challenges</a></li>
<li><a href="#org917291b">2. Protecting Service Mesh</a></li>
<li><a href="#org0d1e64a">3. Communication Protection: External</a>
<ul>
<li><a href="#orge706b82">3.1. TLS</a></li>
</ul>
</li>
<li><a href="#org94e4315">4. Communication Protection: Internal</a></li>
<li><a href="#orgfd9cd53">5. Individual Microservice: Interfaces</a>
<ul>
<li><a href="#orgdb8b923">5.1. JWTs</a></li>
<li><a href="#org3049b22">5.2. Port Management</a></li>
<li><a href="#orgc12e02c">5.3. Access Control</a></li>
<li><a href="#org32a7ff2">5.4. Info Leakage</a></li>
<li><a href="#orga8f7008">5.5. Middleware</a></li>
</ul>
</li>
<li><a href="#orgacdd6e3">6. Individual Microservice: Internals</a></li>
</ul>
</div>
</div>
<div id="outline-container-org402f049" class="outline-2">
<h2 id="org402f049"><span class="section-number-2">1.</span> Challenges</h2>
<div class="outline-text-2" id="text-1">
<p>
Involves many small services, each handling specific business.
</p>

<p>
Concerns involve access control, secure communication, protection
against data theft, or unauthorized access.
</p>

<p>
<span class="underline">Goal</span>: controlling access and security communication routes
</p>
</div>
</div>
<div id="outline-container-org917291b" class="outline-2">
<h2 id="org917291b"><span class="section-number-2">2.</span> Protecting Service Mesh</h2>
<div class="outline-text-2" id="text-2">
<p>
Objective is to protect internal services from public access:
</p>
<ul class="org-ul">
<li>minimize attack surface</li>
<li>prevent direct public access to services</li>
</ul>

<p>
Inadequate protection can result in:
</p>
<ul class="org-ul">
<li>increased security overhead</li>
<li>easier target identification for attackers</li>
<li>potential for escalated attacks upon service compromise</li>
</ul>

<p>
Helps to use API gateway:
</p>
<ul class="org-ul">
<li>defines exposed routes to client applications</li>
<li>differentiates between public and internal APIs</li>
<li>reduces attack surface
<ul class="org-ul">
<li>expose only necessary routes and endpoints</li>
<li>minimize potential targets for attackers</li>
</ul></li>
</ul>

<p>
To implement security using API gateway:
</p>
<ul class="org-ul">
<li><span class="underline">global auth techniques</span>: enforce API access tokens for
auth and verify pre-shared secrets for each client app</li>
<li><span class="underline">differentiation of app access</span>: unique API access token
for each app, which helps in limiting API access based on
client app</li>
<li><span class="underline">security strategies</span>: implement rate-limiting to prevent
DoS attacks and mitigate overload of microservices by external
requests</li>
<li><span class="underline">management security</span>: enforce strict access rules to manage
infrastructure and integrate with active directory or simple
services for control plane protection</li>
<li><span class="underline">protecting outbound communication</span>: secure communication with
external dependencies</li>
</ul>
</div>
</div>
<div id="outline-container-org0d1e64a" class="outline-2">
<h2 id="org0d1e64a"><span class="section-number-2">3.</span> Communication Protection: External</h2>
<div class="outline-text-2" id="text-3">
<p>
With certification verification, can prevent man-in-the-middle
attacks by ensuring that client communicates with intended server
(can distinguish between malicious and legitimate servers).
</p>
</div>
<div id="outline-container-orge706b82" class="outline-3">
<h3 id="orge706b82"><span class="section-number-3">3.1.</span> TLS</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Use of HTTPS/TLS encrypts and authenticates communication channels
and ensures confidentiality and authenticity of data in transit.
</p>

<p>
TLS protocol involves a handshake between communicating parties and server
presents a certificate containing a public key.
</p>

<p>
TLS Certificate components:
</p>
<ul class="org-ul">
<li>public key enclosed in signed envelope</li>
<li>signature by issuing authority using a private key</li>
</ul>

<p>
Private key security prevents leakage of private keys that compromises
certificate authenticity.
</p>

<p>
Client certificate verification strategies:
</p>
<ul class="org-ul">
<li>accept all certificates</li>
<li>accept self-signed certificates</li>
<li>accept certificates signed by trusted authorities</li>
<li>accept only a specific certificate (certificate pinning)</li>
</ul>

<p>
In standard TLS, only client verifies server certificate.
</p>

<p>
In <b>mutual TLS</b>, both client and server present and verify certificates using
similar verification strategies as standard TLS.
</p>
</div>
</div>
</div>
<div id="outline-container-org94e4315" class="outline-2">
<h2 id="org94e4315"><span class="section-number-2">4.</span> Communication Protection: Internal</h2>
<div class="outline-text-2" id="text-4">
<p>
Want to avoid different services talking directly to one another.
</p>

<p>
Must limit damage that can be done in scenario when intruder breaks into cluster.
</p>

<p>
Have communication be between namespaces, grouping clusters into smaller,
manageable units, where each namespace acts like a distinct segment.
</p>

<p>
Network policies in Kubernetes:
</p>
<ul class="org-ul">
<li>regulate traffic between namespaces</li>
<li>define rules for inbound and outbound traffic</li>
</ul>

<p>
<span class="underline">Outbound traffic control</span> prevents misuse of services for attacks like
server-side request forgery (SSRF) and protects against installation of
malicious software.
</p>

<p>
Behaviour monitoring frameworks define expected behaviour via config files.
</p>

<p>
Security alerts notify operators on deviation from normal behaviour and
enhance detection of suspicious activities within the cluster.
</p>

<p>
Resource quotas set limits on resources like memory and CPU per namespace.
</p>

<p>
Preventing DoS attacks by limiting resource consumption (essential for
maintaining service availability).
</p>
</div>
</div>
<div id="outline-container-orgfd9cd53" class="outline-2">
<h2 id="orgfd9cd53"><span class="section-number-2">5.</span> Individual Microservice: Interfaces</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgdb8b923" class="outline-3">
<h3 id="orgdb8b923"><span class="section-number-3">5.1.</span> JWTs</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Use JSON WebTokens (JWTs) for identity verification:
</p>
<ul class="org-ul">
<li>consists of header, body, and signature</li>
<li>header specifies signing algorithm</li>
<li>body contains user claims and token validity</li>
<li>signature ensures token integrity and authenticity</li>
</ul>

<p>
Balance token lifespan for security and validity.
Use refresh tokens for longer validity.
</p>

<p>
User credentials verified by auth service and
successful validation leads to JWT issuance.
</p>

<p>
To manage tokens, issue both access and refresh tokens.
Revoke and renew tokens upon expiration.
</p>

<p>
To minimize risks of token theft, automatically invalidate
all user tokens if one is compromised.
</p>

<p>
For token management in microservices:
</p>
<ul class="org-ul">
<li>use external provider for token generation and have token
validation at API gateway or individually by services</li>
<li>(undesirable) each service manages its own token
generation and validation</li>
<li>centralized token generation, so individual services
validate tokens using asymmetric cryptography with
secret key only known to auth service</li>
</ul>
</div>
</div>
<div id="outline-container-org3049b22" class="outline-3">
<h3 id="org3049b22"><span class="section-number-3">5.2.</span> Port Management</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Minimize open ports (only essential ports open) and
avoid unnecessary management interfaces.
</p>

<p>
Additional open ports increase attack surface (high-risk
targets).
</p>
</div>
</div>
<div id="outline-container-orgc12e02c" class="outline-3">
<h3 id="orgc12e02c"><span class="section-number-3">5.3.</span> Access Control</h3>
<div class="outline-text-3" id="text-5-3">
<p>
<b>Selective visitor acceptance</b>: use access-control lists for critical services
</p>

<p>
API gateway enriches HTTP headers with source IP and services check IP
against allow list for access.
</p>
</div>
</div>
<div id="outline-container-org32a7ff2" class="outline-3">
<h3 id="org32a7ff2"><span class="section-number-3">5.4.</span> Info Leakage</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Prevent leakage of internal backend details by sanitizing errors and exceptions.
</p>
</div>
</div>
<div id="outline-container-orga8f7008" class="outline-3">
<h3 id="orga8f7008"><span class="section-number-3">5.5.</span> Middleware</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Using middleware can cross-cut security concerns.
Recommended order for middleware is exception, authentication, authorization, and
access control.
</p>

<p>
Can also have rate-limiting middleware based on source IP or user identity.
</p>
</div>
</div>
</div>
<div id="outline-container-orgacdd6e3" class="outline-2">
<h2 id="orgacdd6e3"><span class="section-number-2">6.</span> Individual Microservice: Internals</h2>
<div class="outline-text-2" id="text-6">
<p>
<b>Docker container hardening</b>: restrict ports for communication and avoid running
containers as root user (create new user in Dockerfile, dropping unnecessary
rights, file system read-only)
</p>

<p>
Input data validation is essential to prevent unauthorized data manipulation.
</p>

<p>
Risks of input data validation:
</p>
<ul class="org-ul">
<li><span class="underline">SQL injection risk</span>: risk from string concatenation in SQL queries</li>
<li><span class="underline">remote code execution (RCE) vulnerability</span>: potential for attacker-controlled
process execution or reverse shell creation</li>
<li><span class="underline">cross-Site Scripting (XSS)</span>: data passed between services without sanitization,
so risks in frontend usage</li>
</ul>

<p>
To validate input data: validate integer ranges, string usage contextually, and
ensure data transfer object deserialization is secure.
</p>

<p>
Can also do context-specific string validation.
</p>

<p>
Can store secrets with hard coding, providing secrets as files or environment variables,
or dynamically retrieving secrets via a network (read only vault that checks IP).
</p>

<p>
Key revocation process and key rotation are important.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Arnav Gupta</p>
<p class="date">Created: 2024-12-11 Wed 01:00</p>
</div>
</body>
</html>
