3B/SE464/17-Secure-Microservices.tex
% Created 2024-12-11 Wed 01:00
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage{parskip,darkmode}
\enabledarkmode
\author{Arnav Gupta}
\date{\today}
\title{Secure Microservices}
\hypersetup{
 pdfauthor={Arnav Gupta},
 pdftitle={Secure Microservices},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.7.11)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Challenges}
\label{sec:orgd6c1c5a}
Involves many small services, each handling specific business.

Concerns involve access control, secure communication, protection
against data theft, or unauthorized access.

\uline{Goal}: controlling access and security communication routes
\section{Protecting Service Mesh}
\label{sec:org779f725}
Objective is to protect internal services from public access:
\begin{itemize}
\item minimize attack surface
\item prevent direct public access to services
\end{itemize}

Inadequate protection can result in:
\begin{itemize}
\item increased security overhead
\item easier target identification for attackers
\item potential for escalated attacks upon service compromise
\end{itemize}

Helps to use API gateway:
\begin{itemize}
\item defines exposed routes to client applications
\item differentiates between public and internal APIs
\item reduces attack surface
\begin{itemize}
\item expose only necessary routes and endpoints
\item minimize potential targets for attackers
\end{itemize}
\end{itemize}

To implement security using API gateway:
\begin{itemize}
\item \uline{global auth techniques}: enforce API access tokens for
auth and verify pre-shared secrets for each client app
\item \uline{differentiation of app access}: unique API access token
for each app, which helps in limiting API access based on
client app
\item \uline{security strategies}: implement rate-limiting to prevent
DoS attacks and mitigate overload of microservices by external
requests
\item \uline{management security}: enforce strict access rules to manage
infrastructure and integrate with active directory or simple
services for control plane protection
\item \uline{protecting outbound communication}: secure communication with
external dependencies
\end{itemize}
\section{Communication Protection: External}
\label{sec:org38910d0}
With certification verification, can prevent man-in-the-middle
attacks by ensuring that client communicates with intended server
(can distinguish between malicious and legitimate servers).
\subsection{TLS}
\label{sec:org6af8eed}
Use of HTTPS/TLS encrypts and authenticates communication channels
and ensures confidentiality and authenticity of data in transit.

TLS protocol involves a handshake between communicating parties and server
presents a certificate containing a public key.

TLS Certificate components:
\begin{itemize}
\item public key enclosed in signed envelope
\item signature by issuing authority using a private key
\end{itemize}

Private key security prevents leakage of private keys that compromises
certificate authenticity.

Client certificate verification strategies:
\begin{itemize}
\item accept all certificates
\item accept self-signed certificates
\item accept certificates signed by trusted authorities
\item accept only a specific certificate (certificate pinning)
\end{itemize}

In standard TLS, only client verifies server certificate.

In \textbf{mutual TLS}, both client and server present and verify certificates using
similar verification strategies as standard TLS.
\section{Communication Protection: Internal}
\label{sec:orgb10a9f5}
Want to avoid different services talking directly to one another.

Must limit damage that can be done in scenario when intruder breaks into cluster.

Have communication be between namespaces, grouping clusters into smaller,
manageable units, where each namespace acts like a distinct segment.

Network policies in Kubernetes:
\begin{itemize}
\item regulate traffic between namespaces
\item define rules for inbound and outbound traffic
\end{itemize}

\uline{Outbound traffic control} prevents misuse of services for attacks like
server-side request forgery (SSRF) and protects against installation of
malicious software.

Behaviour monitoring frameworks define expected behaviour via config files.

Security alerts notify operators on deviation from normal behaviour and
enhance detection of suspicious activities within the cluster.

Resource quotas set limits on resources like memory and CPU per namespace.

Preventing DoS attacks by limiting resource consumption (essential for
maintaining service availability).
\section{Individual Microservice: Interfaces}
\label{sec:org34d48be}
\subsection{JWTs}
\label{sec:org161c553}
Use JSON WebTokens (JWTs) for identity verification:
\begin{itemize}
\item consists of header, body, and signature
\item header specifies signing algorithm
\item body contains user claims and token validity
\item signature ensures token integrity and authenticity
\end{itemize}

Balance token lifespan for security and validity.
Use refresh tokens for longer validity.

User credentials verified by auth service and
successful validation leads to JWT issuance.

To manage tokens, issue both access and refresh tokens.
Revoke and renew tokens upon expiration.

To minimize risks of token theft, automatically invalidate
all user tokens if one is compromised.

For token management in microservices:
\begin{itemize}
\item use external provider for token generation and have token
validation at API gateway or individually by services
\item (undesirable) each service manages its own token
generation and validation
\item centralized token generation, so individual services
validate tokens using asymmetric cryptography with
secret key only known to auth service
\end{itemize}
\subsection{Port Management}
\label{sec:org2831717}
Minimize open ports (only essential ports open) and
avoid unnecessary management interfaces.

Additional open ports increase attack surface (high-risk
targets).
\subsection{Access Control}
\label{sec:org34983d3}
\textbf{Selective visitor acceptance}: use access-control lists for critical services

API gateway enriches HTTP headers with source IP and services check IP
against allow list for access.
\subsection{Info Leakage}
\label{sec:org5a7d9d4}
Prevent leakage of internal backend details by sanitizing errors and exceptions.
\subsection{Middleware}
\label{sec:org2b136ca}
Using middleware can cross-cut security concerns.
Recommended order for middleware is exception, authentication, authorization, and
access control.

Can also have rate-limiting middleware based on source IP or user identity.
\section{Individual Microservice: Internals}
\label{sec:org7c9a637}
\textbf{Docker container hardening}: restrict ports for communication and avoid running
containers as root user (create new user in Dockerfile, dropping unnecessary
rights, file system read-only)

Input data validation is essential to prevent unauthorized data manipulation.

Risks of input data validation:
\begin{itemize}
\item \uline{SQL injection risk}: risk from string concatenation in SQL queries
\item \uline{remote code execution (RCE) vulnerability}: potential for attacker-controlled
process execution or reverse shell creation
\item \uline{cross-Site Scripting (XSS)}: data passed between services without sanitization,
so risks in frontend usage
\end{itemize}

To validate input data: validate integer ranges, string usage contextually, and
ensure data transfer object deserialization is secure.

Can also do context-specific string validation.

Can store secrets with hard coding, providing secrets as files or environment variables,
or dynamically retrieving secrets via a network (read only vault that checks IP).

Key revocation process and key rotation are important.
\end{document}
